my_list=[42,43]
my_dict={
    'foo':{
        'a':12,
        'b':(1,2,3,4,my_list)
    },
    'bar':
        {
        'c':12,
        'd':{5,6,7,8}
        },
    'moo':{
        'e':12,
        'f':{'Lol':['L','o','l']}
    },
}
# 4  Снова вывести на консоль значение ключа 'b'
# print(my_dict['foo']['b'])

# 5  Вывести множество
# print(my_dict)

# 6  Добавить во множество элемент 9
# my_dict.setdefault(9)
# print(my_dict)
